{
    "name": "Classic Punjabi Samosas",
    "serving_size": "12-15 samosas",
    "ingredients": [
        "For the Pastry:",
        "2 cups all-purpose flour",
        "1/4 teaspoon carom seeds (ajwain)",
        "1/2 teaspoon salt",
        "4 tablespoons vegetable oil or ghee",
        "1/2 cup water, or as needed",
        "For the Filling:",
        "2 medium potatoes, boiled, peeled, and mashed",
        "1/2 cup green peas, boiled",
        "1 tablespoon vegetable oil",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon coriander powder",
        "1/4 teaspoon turmeric powder",
        "1/4 teaspoon red chili powder (or to taste)",
        "1/4 teaspoon garam masala",
        "1/4 teaspoon amchur powder (dry mango powder)",
        "1/2 teaspoon ginger-garlic paste",
        "1-2 green chilies, finely chopped (optional)",
        "Salt to taste",
        "Fresh cilantro leaves, chopped (for garnish)",
        "Oil for deep frying"
    ],
    "instructions": [
        "Make the Pastry: In a large bowl, combine flour, carom seeds, and salt. Add oil or ghee and rub it into the flour mixture with your fingertips until it resembles breadcrumbs. Gradually add water, kneading to form a firm, non-sticky dough. Cover and let it rest for at least 30 minutes.",
        "Make the Filling: Heat oil in a pan over medium heat. Add cumin seeds and let them splutter. Add ginger-garlic paste and green chilies (if using) and sauté for a few seconds. Add coriander powder, turmeric powder, and red chili powder. Sauté for another minute. Add the mashed potatoes and boiled peas. Mix well. Add garam masala, amchur powder, and salt. Mix thoroughly and cook for 2-3 minutes. Remove from heat and let it cool. Garnish with fresh cilantro.",
        "Assemble the Samosas: Divide the dough into equal portions (about 12-15). Roll each portion into a small circle (about 4-5 inches in diameter). Cut the circle in half. Take one half-circle and moisten the straight edge with water. Fold the straight edge to form a cone, pressing the edges to seal. Fill the cone with the potato filling (about 1-2 tablespoons). Moisten the top edge of the cone with water and seal it completely. Repeat with the remaining dough and filling.",
        "Fry the Samosas: Heat oil in a deep frying pan or wok over medium-low heat. Gently drop the samosas into the hot oil, ensuring not to overcrowd the pan. Fry them until they turn golden brown and crispy, turning occasionally for even cooking (about 10-12 minutes). Remove the samosas from the oil and drain them on paper towels.",
        "Serve hot with mint chutney, tamarind chutney, or ketchup."
    ]
}